Hi,

I am seeing a variation of this too. I was able to work around it in one instance quoting the account number.

The issue I am seeing is that the leading zero is being silently dropped.  Code to reproduce:-

```
data "aws_iam_policy_document" "lambda_ecs_deploy_assume_policy" {
  count = var.environment == "integration" ? 1 : 0
  statement {
    actions = [
      "sts:AssumeRole"
    ]
    principals {
      type        = "AWS"
      identifiers = ["arn:aws:iam::${var.account_ids.management}:root"]
    }
  }
}
```

Plan output:-

```
 # aws_iam_role.lambda_ecs_deploy[0] will be created
  + resource "aws_iam_role" "lambda_ecs_deploy" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::11111111111:root"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rep-integration-lambda-ecs-deploy"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "integration"
          + "Project"     = "rep"
        }
      + unique_id             = (known after apply)
    }
```

The real account number is 011111111111 (well obviously not but I'm not pasting the real one here)

Thanks,
Trevor
